function revrot(str, sz) {
    // 123456 9876 54
    
    // 234561 876 549
    // var a = getPow('12345'); // 225 不能被2整除 // 左旋转
    // 23456 18769  54
    // var a = getPow('987'); // 1584 能被2整除 翻转
    // 234561  
    // var a = getPow('54'); // 918 不能被2整除 // 左旋转
    //  
    // console.log(a)
    // 
    

    // 12345 6 987 6 53
    // 
    // 234561 9876 53
    // 234561 6789 53 
    // 
    // 234561 35 6 789
    // 
    // 单	   双
    // 66443 8 75      ====   6443 8 756
    // 6443 8 756  ->  657 8 3446
    // 6443 8 756
    // 
    // 66443 8 769     ====   67 8 34466
    // 6443 8 7696 ->  6967 8 3446
    // 6967 8 3446 --> 
    // 
    // 
    // 67 8 34466       ====   6443 8756
    // 
    // 
}
// 3875 = 8753 // 第一位向后移
revrot();
console.log(getPow('66443'));
console.log(getPow('75'));
console.log(getPow('769'));

function getPow(str){
	var sum = 0;
	for(var i = 0; i<str.length; i++){
		sum += Math.pow(str[i],3);
	}
	return sum;
}